const itemInfo: ItemInfoMap = {
  衍质源石: {
    id: '衍质源石',
    name: '衍质源石',
    value: 40,
    pulls: 75 / 500,
  },
  嵌晶玉: {
    id: '嵌晶玉',
    name: '嵌晶玉',
    value: 40 / 75,
    pulls: 1 / 500,
  },
  折金票: {
    id: '折金票',
    name: '折金票',
    value: 0.002352941,
  },
  干员作战记录经验: {
    id: '干员作战记录经验',
    name: '干员作战记录经验',
    value: 0.000470588,
  },
  初级作战记录: {
    id: '初级作战记录',
    name: '初级作战记录',
    value: 0.094117647,
  },
  中级作战记录: {
    id: '中级作战记录',
    name: '中级作战记录',
    value: 0.470588235,
  },
  高级作战记录: {
    id: '高级作战记录',
    name: '高级作战记录',
    value: 4.705882353,
  },
  干员认知载体经验: {
    id: '干员认知载体经验',
    name: '干员认知载体经验',
    value: 0.001176471,
  },
  初级认知载体: {
    id: '初级认知载体',
    name: '初级认知载体',
    value: 1.176470588,
  },
  高级认知载体: {
    id: '高级认知载体',
    name: '高级认知载体',
    value: 11.76470588,
  },
  协议圆盘: {
    id: '协议圆盘',
    name: '协议圆盘',
    value: 2.352941176,
  },
  协议圆盘组: {
    id: '协议圆盘组',
    name: '协议圆盘组',
    value: 5.714285714,
  },
  武器经验: {
    id: '武器经验',
    name: '武器经验',
    value: 0.000470588,
  },
  武器检查单元: {
    id: '武器检查单元',
    name: '武器检查单元',
    value: 0.094117647,
  },
  武器检查装置: {
    id: '武器检查装置',
    name: '武器检查装置',
    value: 0.470588235,
  },
  武器检查套组: {
    id: '武器检查套组',
    name: '武器检查套组',
    value: 4.705882353,
  },
  强固模具: {
    id: '强固模具',
    name: '强固模具',
    value: 2.352941176,
  },
  重型强固模具: {
    id: '重型强固模具',
    name: '重型强固模具',
    value: 5.714285714,
  },
  协议棱柱: {
    id: '协议棱柱',
    name: '协议棱柱',
    value: 0.941176471,
  },
  协议棱柱组: {
    id: '协议棱柱组',
    name: '协议棱柱组',
    value: 4.705882353,
  },
  超距辉映管: {
    id: '超距辉映管',
    name: '超距辉映管',
    value: 13.33333333,
  },
  D96钢样品四: {
    id: 'D96钢样品四',
    name: 'D96钢样品四',
    value: 13.33333333,
  },
  快子遴捡晶格: {
    id: '快子遴捡晶格',
    name: '快子遴捡晶格',
    value: 13.33333333,
  },
  象限拟合液: {
    id: '象限拟合液',
    name: '象限拟合液',
    value: 13.33333333,
  },
  三相纳米片: {
    id: '三相纳米片',
    name: '三相纳米片',
    value: 13.33333333,
  },
  基质: {
    id: '基质',
    name: '基质',
    value: 20,
  },
  基础寻访凭证: {
    id: '基础寻访凭证',
    name: '基础寻访凭证',
    value: 266.6666667,
    pulls: 1,
  },
  特许寻访凭证: {
    id: '特许寻访凭证',
    name: '特许寻访凭证',
    value: 266.6666667,
    pulls: 1,
  },
  行火留烬寻访凭证: {
    id: '行火留烬寻访凭证',
    name: '行火留烬寻访凭证',
    value: 266.6666667,
    pulls: 10,
  },
  行火留烬十连凭证: {
    id: '行火留烬十连凭证',
    name: '行火留烬十连凭证',
    value: 2666.666667,
    pulls: 10,
  },
  武库配额: {
    id: '武库配额',
    name: '武库配额',
    value: 112 / 81,
    pulls: 0,
  },
};

export default itemInfo;
